#include "lisp.h"
#include <iostream>
using namespace std;
void main()
{
	lisp *head = NULL; // Посилання на перший елемент списку, так як він рівний нулю, список порожній
	char v; // Змінні в які буде записана інформаційна частина, в "о" - для функції пошуку
	setlocale(LC_ALL, "RUS");
	int choise; // Змінна для користування меню
	do
	{
		cout << "1 - Додати елемент\n";
		cout << "2 - Видалити елемент\n";
		cout << "3 - Вивести поточний список\n";
		cout << "4 - Вийти\n\n";
		cout << "Ваш вибiр: ";
		cin >> choise;
		switch (choise) // Меню
		{
		case 1:
			cout << "Введiть значення елемента: ";
			cin >> v;
			head->addToBegin(&head, v);//При виборі 1 викликається функція додавання елемента з переданими параметрами адреси і введеного користувачем з клавіатури значення
			cout << "Елемент успiшно додано!\n";
			break;
		case 2:
			if (head == NULL)//Перевіряє чи список не порожній
			{
				cout << "Список пустий!\a\n";
			}
			else
			{
				head->del(head);//Якщо не порожній викликається функція видалення елемента
			}
			break;
		case 3:
			if (head == NULL)//Перевіряє чи список не порожній
			{
				cout << "Список пустий!\a\n";
			}
			else
			{
				head->print(head);//Якщо не порожній викликається функція виведення списку на екран
			}
			break;
		case 4:
			break;
		default:
			cout << "Ви ввели не коректний вираз!\a\n";
			break;
		}
		system("pause>>void");
		system("cls");
	} while (choise != 4);
}